Modification of Data

Adding columns

In [1]:
import pandas as pd

In [2]:
data = {
    "Name": ["Amit", "Sita", "Raj", "Priya", "Vikram", "Anjali", "Rohan", "Kiran", "Meera"],
    "Age": [25, 30, 28, 35, 40, 29, 32, 26, 31],
    "Salary": [50000, 60000, 55000, 75000, 80000, 52000, 70000, 48000, 65000],
    "Performance": ["Good", "Excellent", "Average", "Excellent", "Good", "Average", "Good", "Poor", "Excellent"]
}

In [3]:
df = pd.DataFrame(data)

To assign new column we can use:

Square brackets df["Column_name"] = some data

In [4]:
df["Bonus"] = df["Salary"]+df["Salary"] * 0.1

In [5]:
df

     Name  Age  Salary Performance    Bonus
0    Amit   25   50000        Good  55000.0
1    Sita   30   60000   Excellent  66000.0
2     Raj   28   55000     Average  60500.0
3   Priya   35   75000   Excellent  82500.0
4  Vikram   40   80000        Good  88000.0
5  Anjali   29   52000     Average  57200.0
6   Rohan   32   70000        Good  77000.0
7   Kiran   26   48000        Poor  52800.0
8   Meera   31   65000   Excellent  71500.0

Now second using insert function

df.insert(loc, " column_name", "some_data")

In [7]:
df.insert(0,"Employee_id",[101, 102,103,104, 105,106,107,108,109])

In [8]:
df

   Employee_id    Name  Age  Salary Performance    Bonus
0          101    Amit   25   50000        Good  55000.0
1          102    Sita   30   60000   Excellent  66000.0
2          103     Raj   28   55000     Average  60500.0
3          104   Priya   35   75000   Excellent  82500.0
4          105  Vikram   40   80000        Good  88000.0
5          106  Anjali   29   52000     Average  57200.0
6          107   Rohan   32   70000        Good  77000.0
7          108   Kiran   26   48000        Poor  52800.0
8          109   Meera   31   65000   Excellent  71500.0